#Найти и вывести на экран кравдраты и кубы чисел от 2 до 5

l = 2
while l <= 5:
    print('квадрат: ', 3 * l)
    print('куб: ', 2 * l)
    l+=1
