"""Даны температуры за март месяц. Необходимо найти кол-во
положительных и отрицательных температур в месяце, самую низкую
и самую высокую температуры, а также среднемесячное значение
температуры"""

import random
r = [random.randint(-10,15) for i in range(11)]
print(r)
s1 = len(list(filter(lambda x: x > 0, r)))
s2 = len(list(filter(lambda x: x < 0, r)))
m1 = max(r)
m2 = min(r)
s3 = sum(r)/len(r)
print(f"мин = {m2} макс = {m1} среднее = {s3} кол-во мин = {s1} кол-во макс = {s2}")

