import sqlite3

DB_NAME = "tour_agency.db"


def insert_data():
    initial_tourists = [
        ("Иванов", "89991112233", "Италия", "Европа", 10, 120000.00),
        ("Петров", "89992223344", "Египет", "Африка", 7, 65000.00),
        ("Сидоров", "89993334455", "Турция", "Азия", 14, 85000.00),
        ("Смирнов", "89994445566", "Италия", "Европа", 5, 95000.00),
        ("Кузнецов", "89995556677", "ОАЭ", "Азия", 0, 150000.00),
        ("Попов", "89996667788", "Таиланд", "Азия", 11, 110000.00),
        ("Васильев", "89997778899", "Испания", "Европа", 9, 135000.00),
        ("Соколов", "89998889900", "Мальдивы", "Азия", 12, 350000.00),
        ("Михайлов", "89999990011", "Турция", "Азия", 4, 45000.00),
        ("Новиков", "89990001122", "Италия", "Европа", 21, 250000.00)
    ]

    with sqlite3.connect(DB_NAME) as conn:
        cursor = conn.cursor()
        #проверка на пустую базу
        cursor.execute("SELECT COUNT(*) FROM tourist")
        if cursor.fetchone()[0] == 0:
            #первичное заполнение
            cursor.executemany("""
                INSERT INTO tourist (last_name, phone, country_name, region, duration, cost)
                VALUES (?, ?, ?, ?, ?, ?)
            """, initial_tourists)
            #сохранение изменений
            conn.commit()
