id_info = [
    (1, 'Пчелов', 89992343853, 'Россия', 61, 7, 13000),
    (2, 'Шевлюга', 8933343673, 'Беларусь', 32, 3, 12500),
    (3, 'Кирин', 89943678853, 'Тайланд', 66, 99, 11000),
    (4, 'Мышок', 8999845753, 'Казахстан', 44, 54, 17000),
    (5, 'Кирков', 8999492436, 'Чехия', 97, 34, 20000),
    (6, 'Иванов', 89999687233, 'Узбекистан', 461, 22, 13500),
    (7, 'Черкессов', 89393573853, 'Россия', 900, 78, 14700),
    (8, 'Зайкин', 89990095353, 'Соединенные Штаты Америки', 11, 32, 19000),
    (9, 'Уралов', 89992236543, 'Россия', 615, 71, 18000),
    (10, 'Фонин', 89992009783, 'Россия', 51, 1, 16000)
]
